#include<bits/stdc++.h>
using namespace std;
int main(){
    return 0;
}
/*
V 999000
Max Combo 1000
999     1    0   0
Perfect Good Bad Miss
*/

/*
要在CSP-S的复赛拿到1=是非常难的，
为了达成这个目标，我们可以利用派蒙在17世纪末期提出的
著名的“阿伏伽德罗定理”，
这个定理的推导过程十分简单，
只需秤取（π*√2）帕斯卡的高锰酸钾
并浸泡在装有水的小烧杯中隔酒精加热，
就能观察到尼罗河流域地区出现台风灾害，
同时白宫会分泌大量的有机酸并将他们排至酿泉
造就“泉香而酒洌”的现象
之所以出现这种现象，
是因为在催化剂的作用下，
网络这把双刃剑会逐渐分解为
过去进行时与三省六部制，
极大的促进了古希腊民主政治的发展。
该反应的文字表达式为：
网络?过去进行时+三省六部制↑
而过去进行时不稳定，易分解为小灯泡与博丽灵梦
因此网络可用于工业制备博丽灵梦。
现在市面上售卖的博丽灵梦，很多都是使用这种方式制作的，
极少有野生博丽灵梦。
但与博丽灵梦相反的是，琦露诺在野外种群庞大，且低智商易捕捉，
而目前并没有有效的工业制备方式。
琦露诺也是一种重要的工业原料，
她可以将各类baka化物还原。
例：9baka化4??? + 琦露诺 ? 9baka化琦露诺 + ???
综上所述，阿伏伽德罗定理是哲学界最具影响力的定理之一，
他的出现让人们的科学探究之路又前进了一步。
*/