#include <bits/stdc++.h>
using namespace std;

int c, t, n, m, k, d, x[110], y[110], z[110], dp[110][110][2];

int main(){
    freopen("run.in", "r", stdin);
    freopen("run.out", "w", stdout);
    scanf("%d%d%", &c, &t);
    while(t --){
//        memset(dp, 0, sizeof dp);
 //       scanf("%d%d%d%d", &n, &m, &k, &d);
 //       for(int i = 0; i < m; i ++){
 //           scanf("%d%d%d", &x[i], &y[i], &z[i]);
  //      }
  //      for(int i = 1; i <= n; i ++){
  //          for(int j = 1; j <= k; j ++){
  //              dp[i][0][0] = max(dp[i - 1][j][0], dp[i - 1][0][0]);
 //               dp[i][j][1] = dp[i - 1][j - 1][1] - d;
 //           }
 //       }
        printf("0\n");
    }
    return 0;
}
/* 然而并没有推出这个dp式子
距离考试结束还有10分钟，也没时间再写别的了
RP ++；希望T1糊上去的贪正确性对了
希望自己至少能有保底70 + 40 + 5 + 0 = 115分，刚好不够去年一等线，哈哈。
没关系，反正去年因为T1多测挂了一车人，今年应该会高很多吧，毕竟这么简单的题只有我不会做。
运气好的话能有100 + 40 + 10 + 0 = 150分。不管怎么说应该至少能拿个省三吧。
其实看今年的题已经是老天爷在眷顾我了。感觉除了T4还算是发挥了自己的水平，T1也能走狗运推出来。
OI生涯也就止步于此了吧，J1S2 NOIP或许有3，感觉到了最后也还是没入门的小白啊
真心希望机房里的几位大佬同学能切穿NOIP，拿到对得起自己付出的好成绩。
马上就要结束了。现在想想，带病考成这样我以及知足了。
先走一步！NOIP 2023，堂堂落幕！*/