#include <bits/stdc++.h>
using namespace std;

int main()
{
    freopen("run.in", "r", stdin);
    freopen("run.out", "w", stdout);
    cout << 2 << endl;
    fclose(stdin);
    fclose(stdout);
    return 0;
}

/*
2023年11月18日，是一个美妙的星期六，这一天有去学校上课的同学，又有在家复习考试的小可爱，同时，还有像我一样来参加noip的冤大头。
亏了前几年摆烂没进noip，否则又不知道亏了多少钱，哦谢，今年题难度有待降低，平衡性就没有，你看看第一题，如此简单的字典排序，有时你看看第四题，真抽象阿，一个人锻炼身体，负提升。
你看看第三题，什么东西，说难不如第四题，说简单点，这题上来看了十分钟连用什么算法都没看出来，真抽象阿。
听说每年都有向我这么闲的笨b来这里写小作文吐槽。
最后说一句，第三题题目说防止有人丢硬币解决问题，难道每年都有人这么干使你不得不防么，你不提我都不知道。

宇宙级免责说名：
本篇意在吐槽题目，没有任何其他意思哦。
同时也没有规定不能下小作文吧。
有的话下次再说到禁止事项里哦。
就这样，再见。
（单纯因为马上交卷了没时间写力！！！！）
*/
