#include<bits/stdc++.h>
using namespace std;
int main(){
    cout<<10086;
    return 0;
}
//I €??? ＄?LV? ?HI＄ ????L??
//??? I €?? ??? ??? ? ?????R $I??LY
//I LIKE PLAYING ??€???
//WO MEN YUAN SHEN ZEN ME NI LE
//RP+=10086
//€€?.MONEY[2023]+=840(指J组S组初赛复赛报名费加起来一共840元)
//Me:   ?
//€€?:??
//   ???
//Me:???
//   ???
//When I editing the code:?????
/*
我认为C++就应该在每天早上学，
这是因为三角函数中X的取值范围
受到细胞质溶液浓度与议论文中论据的个数的影响，
根据这个现象，意大利著名文学家贾宝玉提出了以鲁迅命名的滑块定律，
也即钩玛在浓度为98%的稀氢氧化氢中溶解产生南极圈的量
等于德国在二战前的常备军数量之平方与吃波罗比萨的意大利人加一之比。
这是因为自从查士丁尼颁布《哥伦布法典》后，
动词过去式的变形就有了统一标准，
《五年高考三年模拟》中规定：
“倘奴隶告其主人云‘你非我之主人’，
则其主需列出质能方程，然后此奴隶得进入虫洞。“
虫洞中含有大量的比喻手法和少量的电压，
普通中学的化学实验室约占虫洞体积的五分之一。
由此可以得出结论：对于两个体积相同的物体，
速度越大则化合价越大。
因此，如果我们能测出物体的速度和化合价，
就能计算出该物体的三角函数值=114514。
这个现象在公元前1919年被徐霞客提出，
并由刘禹锡在他的著作《国富论》中得以证明。
*/