#include <bits/stdc++.h>

using namespace std;

int main()
{
    freopen("run.in","r",stdin);
    freopen("run.out","w",stdout);
    printf("2");
    return 0;
}
// 1.选手须同时携带个人有效身份证件、准考证入场。入座后，将个人证件及准考证放置在桌子上，供监考核查。监考需核对选手本人、姓名、性别、学籍学校、证件号、照片等信息是否一致相符。如有不实，视为替考，选手将被取消参赛资格，且从次年算起被禁赛三年。
// 2.选手进入考场时，只许携带笔、橡皮等非电子文具入场。禁止携带任何电子产品或机器设备入场，无存储功能的手表除外；手机（关机）、U盘或移动硬盘、键盘、鼠标、闹钟、计算器、书籍、草稿纸及背包等物品必须存放在考场外。监考人员须尽职告知提醒，并在考前进行认真详细的清理和检查。如有选手违规带入的，一经发现，监考人员必须及时处理，并根据情节报请各省总负责人直至取消选手参赛资格。
// 3.活动开始15分钟后，选手不得进入考场，以缺考处理；除去洗手间外，活动期间，全程不能早退，必须在活动正式结束后，统一离场。
// 4.选手进入考场后，在活动正式开始前，禁止操作机器、使用鼠标键盘等设备。
// 5.在活动过程中，考点各考场统一提供草稿纸（A4打印纸）。草稿纸不足时，选手可举手向监考示意并索要。
// 6.活动期间，要求选手注意及时保存自己的程序代码，如出现系统死机、崩溃或硬件故障的情况，选手需立即举手向监考求助；如经监考组技术人员确认非选手责任，选手可获得加时补偿，加时补偿只用于补偿解决机器问题所消耗的时间，不受理选手以未及时存盘为由提出的回忆代码的时间补偿。由于选手程序的错误和操作不当所造成的死机或文件丢失，不得申请延时。
// 7.活动期间，如有选手相互讨论、使用网络、利用各种方式拷贝或传递信息等违反考场纪律的，涉事选手均可被立刻取消参赛资格，并从次年算起被禁赛三年。
// 8.活动期间，选手在去洗手间前举手向监考示意，由志愿者带领前往。
// 9.活动结束后，选手应立即停止答题、不要关闭计算机、迅速且有序地离开考场，加时选手除外。选手离开后禁止在考场外逗留或返回考场。如有选手违反，成绩以零分记。加时选手在宣布加时结束后应遵循相关规定迅速离场。